run/icoPhaseChangeVoF/testSolidification/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         40.0;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   1.0;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDiCo         15;

maxDeltaT       1e-2;

DebugSwitches
{
    solidificationModel 1;
    evaporationModel 1;
}

OptimisationSwitches
{
    fileHandler collated;
}

// ************************************************************************* //
