run/icoPhaseChangeVoF/testSolidification/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc div(phi, result=divU)

#includeFunc cellMax(name=maxValue, p_rgh, T, divU, writeControl=writeTime, log=yes)
#includeFunc cellMin(name=minValue, p_rgh, T, divU, writeControl=writeTime, log=yes)
#includeFunc cellMaxMag(name=maxMagValue, U, writeControl=writeTime, log=yes)


// ************************************************************************* //
